{
  "Villagers": [
    {
      "id": 0,
      "Name": "Alex",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/6/69/Alex_Gridball.png",
      "Caption": "I'd ask you to throw the ball around, but you don't really seem like the sports type",
      "Comments": [
        "Hey, Now that's what I'm talking about!",
        "Hey, nice tan.",
        "I'm just enjoying the scenery...hehe."
      ]
    },
    {
      "id": 1,
      "Name": "Elliot",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/3/3c/Elliott_Beach_Surprised.png",
      "Caption": "The sun is angry today... My skin is a bit too delicate, I'm afraid.",
      "Comments": [
        "Visit my cabin whenever you like. I could use the company.",
        "I was just thinking about you. Maybe you sensed it.",
        "I enjoy seeing you so relaxed, my dear."
      ]
    },
    {
      "id": 2,
      "Name": "Harvey",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/1/1b/Harvey_Neutral.png",
      "Caption": " I'm Harvey, the local doctor. I perform regular check-ups and medical procedures for all the residents of Pelican Town.",
      "Comments": [
        "It's a beautiful day, isn't it?",
        "It's flu season, so you'd better be extra careful. Make sure to wash your hands often.",
        "Feel free to stop by my office if you're ever feeling ill. "
      ]
    },
    {
      "id": 3,
      "Name": "Sam",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/1/19/Sam_Winter_01.png",
      "Caption": "I like taking walks in the forest this time of year. The temperature is so comfortable.",
      "Comments": [
        "Did you watch the game last night?",
        "Hey, I’m Sam. Good to meet you.",
        "It's a nice day, isn't it?"
      ]
    },
    {
      "id": 4,
      "Name": "Sebastian",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/1/12/Sebastian_Working_1.png",
      "Caption": "What am I going to do today? Probably nothing.",
      "Comments": [
        "Having a good weekend?",
        "When I was younger I'd run out to the railroad whenever I heard a train coming. Whatever happened to those days...?",
        "Um... You're single, right? Just wondering!"
      ]
    },
    {
      "id": 5,
      "Name": "Shane",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/e/eb/Shane_Fallen_Down.png",
      "Caption": "I don't have to go into work today, so I'm not complaining...",
      "Comments": [
        "Don't you have work to do?",
        "You're a lot better-looking than me, you know that?",
        "What's the point of life if all you do is work?"
      ]
    },
    {
      "id": 6,
      "Name": "Abigail",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/b/bf/Abigail_Blush.png",
      "Caption": "I used to think Pelican Town was kinda drab, but lately I'm starting to love some things about it.",
      "Comments": [
        "Your hair looks cool today... did you do something different?",
        "Doesn't a steaming hot cup of cocoa sound good right now?",
        "I had an interesting dream last night, with you in it. It was a good dream."
      ]
    },
    {
      "id": 7,
      "Name": "Emily",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/e/e1/Emily_Beach.png",
      "Caption": "This world is full of spirits and magic...",
      "Comments": [
        "It's good weather for a picnic, isn't it?",
        "If I didn't have to work I'd suggest we go on a nice picnic!",
        "If you open your heart to the sun, you can feel a loving energy inside of you."
      ]
    },
    {
      "id": 8,
      "Name": "Haley",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/b/b4/Haley_Winter_13.png",
      "Caption": "I spent all morning doing my hair... now the rain could mess it up. *sigh* ... Life is hard sometimes.",
      "Comments": [
        "Nice makeup. Wait... Are you even wearing any? ",
        "Ew, you're all dirty.",
        "You look like you've been doing a lot of hard work. Why don't you take the rest of the day off?"
      ]
    },
    {
      "id": 9,
      "Name": "Leah",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/3/3f/Leah_Beach_Surprised.png",
      "Caption": "It's simpler to be friends with the trees. They don't have much to say.",
      "Comments": [
        "If you ever find any interesting looking driftwood, I could use it. It would be special that you gave it to me.",
        "Stop by my cabin if you ever need someone to talk to.",
        "Do you ever wonder what it's like to be a different person?"
      ]
    },
    {
      "id": 10,
      "Name": "Maru",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/5/5a/Maru_Nurse_Happy.png",
      "Caption": "My mother is a carpenter and my dad is a scientist. I guess it makes sense that I'm into building gadgets.",
      "Comments": [
        "Stop by our house when you need to upgrade your buildings. It's always nice to have visitors.",
        "Come to my room if you ever want to tinker with my gadgets.",
        "Are you enjoying the season? It's been so warm this year."
      ]
    },
    {
      "id": 11,
      "Name": "Penny",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/c/ca/Penny_Dress.png",
      "Caption": "When you're lost in a book, it's easy to forget the realities of your life. ...Maybe that's why I like reading so much.",
      "Comments": [
        "Hello! I'm Penny.",
        "The weather's interesting today, don't you think?",
        "I was just thinking about the future... Where do you picture yourself in ten years? I have a few ideas for myself..."
      ]
    },
    {
      "id": 12,
      "Name": "Caroline",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/3/3b/Caroline_Happy.png",
      "Caption": "Today I'm just going to relax and think positively. Do you ever take a day off?",
      "Comments": [
        "Stardew Valley is nice, but I wish I knew more people. I'm glad that we've become friends.",
        "On Wednesdays the shop is closed. Keep that in mind if you're going to need anything.",
        "Time seems to go by faster and faster the older you get."
      ]
    },
    {
      "id": 13,
      "Name": "Clint",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/e/e4/Clint_Dress_Up.png",
      "Caption": "I'm Clint. I'm the town blacksmith. If you ever need to upgrade your tools, I'm your guy.",
      "Comments": [
        "All these happy families. But for me, just another lonely year.",
        "Damn it, I'm too old to do anything exciting anymore. All I have to look forward to is years and years of sweaty, hot furnace-work..",
        "Sometimes I wonder how I ended up in this town."
      ]
    },
    {
      "id": 14,
      "Name": "Demetrius",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/f/ff/Demetrius_Concerned.png",
      "Caption": "I'm Demetrius, local scientist and father.",
      "Comments": [
        "It's good to take a break from work every now and then. ",
        "How are you doing today?",
        "Make sure to water your plants every day."
      ]
    },
    {
      "id": 15,
      "Name": "Dwarf",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/4/45/Dwarfscrnshot.png",
      "Caption": "I got all this stuff from the surface. I just take it from your people during the night.",
      "Comments": [
        "Hey, wanna buy something?",
        "If you enter the volcano on Ginger Island, you might encounter others like me. Don't be alarmed! We're peaceful with humans.",
        "Why don't you buy a few things from my shop to ensure your safety?"
      ]
    },
    {
      "id": 16,
      "Name": "Evelyn",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/a/ab/Evelyn_Winter_01.png",
      "Caption": "You can call me 'Granny' if you like.",
      "Comments": [
        "Oh my! What a lovely day.",
        "I saw the most beautiful family of butterflies sunning themselves in the town garden yesterday.",
        "Be careful out there, dear. You could get sunburnt!"
      ]
    },
    {
      "id": 17,
      "Name": "George",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/7/78/George.png",
      "Caption": "Looks like another gloomy day.",
      "Comments": [
        "It's awfully cold, isn't it? What a rotten day.",
        "I dunno what you did, but those raccoons haven't been back since last week!",
        "When you get as old as me it's a lot harder to adjust to new things. One day you'll know what I mean. Go on, enjoy yourself while you're still young."
      ]
    },
    {
      "id": 18,
      "Name": "Gus",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/a/a5/Gus_Happy.png",
      "Caption": "I'm Gus, chef and owner of the Stardrop Saloon. Stop in if you need any refreshments. I've always got hot coffee and cold beer at the ready.",
      "Comments": [
        "I sell different dishes each week, so make sure and check in every now and then! You might taste something spectacular. Just let me know if you have any allergies. Okay, see you around.",
        "Are you much of a chef? ",
        "Meet me at the bar if you need a beverage."
      ]
    },
    {
      "id": 19,
      "Name": "Jas",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/5/52/Jas_Explaining.png",
      "Caption": "Do you like my bow?",
      "Comments": [
        "I'm collecting seashells... I'm gonna make a necklace!",
        "You can play with my dolls if you want to. Just make sure to brush their hair when you're done.",
        "Some day, I'm going to be the flower queen!"
      ]
    },
    {
      "id": 20,
      "Name": "Jodi",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/b/b2/Jodi_Beach_Happy.png",
      "Caption": "Maintaining a household is difficult work... but somebody has to do it. Yes?",
      "Comments": [
        "You aren't exactly how I imagined... but that's okay!",
        "Kent has been home for a while now, but he still seems uneasy.",
        "Where does all the time go?"
      ]
    },
    {
      "id": 21,
      "Name": "Kent",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/0/06/Kent_Concerned.png",
      "Caption": " I don't know if I'll ever get used to being back home. The peacefulness of the town feels like a mask. That's probably just me though.",
      "Comments": [
        "Um, hello there. My name's Kent.",
        "Are you friends with my son?",
        "It looks like a decent day for fishing, doesn't it?"
      ]
    },
    {
      "id": 22,
      "Name": "Krobus",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/b/bb/Krobus_Trenchcoat.png",
      "Caption": "I'm Krobus, a merchant of rare and exotic goods.",
      "Comments": [
        "You've opened my eyes to the world of humans. I appreciate that.",
        "Please, don't be alarmed. I am different than the others. I've spent a lot of time observing humans. I know you like to shop. Care to see my wares?",
        "What a beautiful day!"
      ]
    },
    {
      "id": 23,
      "Name": "Leo",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/9/9d/Leo_Concerned.png",
      "Caption": "When Sun is angry, it feels good in the jungle. Sun can't find us beneath the leaves. We trick him! Haha...",
      "Comments": [
        "I wonder if I could see your home from the top of the volcano?",
        "I'm a little embarrassed to ask.. But... do you think Jas would ever like a guy like me? Or am I too weird? Hahaha... who cares. I'll figure it out some day.",
        "Be careful in the volcano... the spirits don't like outsiders."
      ]
    },
    {
      "id": 24,
      "Name": "Lewis",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/2/2b/Lewis.png",
      "Caption": "It's a good season to start thinking about gardening, even for us non-farmers. The valley is known for producing some of the finest spring flowers!",
      "Comments": [
        "Everyone seems a little happier on the weekends, don't you think?",
        "Have you planted any spring crops yet? The season doesn't last forever, you know.",
        "Gardening is a hobby of mine, so I'm excited for this warm weather."
      ]
    },
    {
      "id": 25,
      "Name": "Linus",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/1/16/Linus_Winter_01.png",
      "Caption": "There's nothing quite like a feast of wild mushrooms in the fall.",
      "Comments": [
        "I've already gathered enough moss for the entire year. How about you?",
        "How have you been, my young friend?",
        "A warm rain is a pleasant way to get clean."
      ]
    },
    {
      "id": 26,
      "Name": "Marnie",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/5/52/Marnie.png",
      "Caption": "Animals are so innocent, so sweet. And If I don't look after them, who will?",
      "Comments": [
        "I'm Marnie! I sell livestock and animal care products at my ranch. You should swing by some time.",
        "I think someone in town has taken a liking to me. *teehee*",
        "Hey there, it's good to see ya! Feel free to visit us any time you please."
      ]
    },
    {
      "id": 27,
      "Name": "Pam",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/5/51/Pam_Beach.png",
      "Caption": "My house ain't pretty but at least it's by the river.",
      "Comments": [
        "Hey, kid. The name's Pam. Don't be a jerk and we'll get along fine.",
        "Hey, you! Don't be snoopin' around the trailer when I'm out. Got it? Sorry, but I gotta be cautious with strangers.",
        "Each day's just the same as the last... If only I'd been born rich..."
      ]
    },
    {
      "id": 32,
      "Name": "Pierre",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/b/be/Pierre_Beach.png",
      "Caption": "It's my day off today. Hmmm... what to do...",
      "Comments": [
        "I'm Pierre, owner of the local general store. If you're looking for seeds, my shop is the place to go.",
        "I'm happy to buy any produce off you. I'll give you a fair price, of course!",
        "Psst... Make sure to swing by the shop tomorrow to get your fall seeds!"
      ]
    },
    {
      "id": 28,
      "Name": "Robin",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/a/aa/Robin_Winter_00.png",
      "Caption": "My husband almost set the house on fire last night with his science experiment. One of his beakers exploded and sent a fireball into the rafters! Thank Yoba I used fire-resistant lacquer when I built the place.",
      "Comments": [
        "Have you met everyone in town yet?",
        "You're always welcome to visit us, even if you aren't shopping, you know. It can get pretty lonely up here in the mountains.",
        "I found an ashtray in Sebastian's room, and it smelled really weird. Should I be worried about this?"
      ]
    },
    {
      "id": 29,
      "Name": "Sandy",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/4/4e/Sandy.png",
      "Caption": "My name's not really Sandy, you know. It's just good for business.",
      "Comments": [
        "Hello hello, sweetie!",
        "Hi there, honey.",
        "Thanks for being my friend."
      ]
    },
    {
      "id": 30,
      "Name": "Vincent",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/f/f7/Vincent_Winter_01.png",
      "Caption": "I wanna be just like my big brother when I grow up!",
      "Comments": [
        "My name's Vincent. Momma says not to talk to strangers... But you seem okay.",
        "Can you keep a secret? I wanna marry Miss Penny when I grow up. Just don't tell her, okay?",
        "I'm bored..."
      ]
    },
    {
      "id": 31,
      "Name": "Willy",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/b/b8/Willy_Winter_03.png",
      "Caption": "I'm a simple man...when my pipe is full, I'm happy. When my pipe is empty...well, then I just fill 'er up again.",
      "Comments": [
        "A true angler has respect for the water... don't you forget that.",
        "Ahoy there!. Looks like decent weather for fishing, eh?",
        "Have you had much luck in the local waters? You look like you could be a strong angler if you set your mind to it."
      ]
    },
    {
      "id": 32,
      "Name": "Wizard",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/c/c7/Wizard.png",
      "Caption": "There are many mysteries around us. You must be patient if you wish to discover them.",
      "Comments": [
        "Ah, yes. I predicted your arrival a long time ago. However, your fate is ultimately in your own hands.",
        "I believe the townsfolk are afraid of me. It is unfortunate, but I suppose it is human to be afraid of the unknown.",
        "I trust you enough to allow you in my basement. Treat what you find there with respect."
      ]
    }
  ],
  "Randoms": [
    {
      "id": 0,
      "Name": "Professor Snail",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/6/68/Professor_Snail_Happy.png",
      "Caption": "If you see something wiggling in the dirt, make sure to excavate it. You never know what might be under there!"
    },
    {
      "id": 1,
      "Name": "Birdie",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/5/54/Birdie_Happy.png",
      "Caption": "Fruit, fish, and foraged food... It's a good diet! I feel as healthy as ever."
    },
    {
      "id": 2,
      "Name": "Bouncer",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/f/f5/Bouncer.png",
      "Caption": "You little punk..."
    },
    {
      "id": 3,
      "Name": "Fizz",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/f/fb/Fizz_03.png",
      "Caption": "I've heard you're trying to achieve 'perfection'. A noble goal! ... but difficult. Very difficult."
    },
    {
      "id": 4,
      "Name": "Gil",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/7/7b/Gil_Surprised.png",
      "Caption": "...*snore*..."
    },
    {
      "id": 5,
      "Name": "Governor",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/9/90/Governor_Neutral.png",
      "Caption": "It's lovely to see economic development in the valley!"
    },
    {
      "id": 6,
      "Name": "Grandpa",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/8/88/Grandpa.png",
      "Caption": "If you're reading this, you must be in dire need of a change. The same thing happened to me, long ago. I'd lost sight of what mattered most in life... real connections with other people and nature. So I dropped everything and moved to the place I truly belong."
    },
    {
      "id": 7,
      "Name": "Gunther",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/3/3d/Gunther.png",
      "Caption": "Hey, if you find any artifacts or minerals out there... would you let me know?"
    },
    {
      "id": 8,
      "Name": "Henchman",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/4/45/Henchman_Portrait_2.png",
      "Caption": "I'm sorry, but I can't let you pass... I'd lose my job."
    },
    {
      "id": 9,
      "Name": "Marlon",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/3/37/Marlon.png",
      "Caption": "Don't get too close to the cage."
    },
    {
      "id": 10,
      "Name": "Morris",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/0/0d/Morris_Surprised.png",
      "Caption": "Buy a Joja Membership today and save big on your next purchase!"
    },
    {
      "id": 11,
      "Name": "Mr. Qi",
      "Img": "https://stardewvalleywiki.com/mediawiki/images/b/b4/Mr._Qi.png",
      "Caption": "I was born an ordinary boy, but I made a decision early in life that I would become extraordinary"
    }
  ]
}